// Generated by jextract

package com.sunya.netchdf.hdf5Clib.ffm;

import java.lang.invoke.MethodHandle;
import java.lang.invoke.VarHandle;
import java.nio.ByteOrder;
import java.lang.foreign.*;
import static java.lang.foreign.ValueLayout.*;
final class constants$172 {

    // Suppresses default constructor, ensuring non-instantiability.
    private constants$172() {}
    static final StructLayout const$0 = MemoryLayout.structLayout(
        MemoryLayout.structLayout(
            JAVA_INT.withName("version"),
            MemoryLayout.paddingLayout(4),
            JAVA_LONG.withName("super_size"),
            JAVA_LONG.withName("super_ext_size")
        ).withName("super"),
        MemoryLayout.structLayout(
            JAVA_INT.withName("version"),
            MemoryLayout.paddingLayout(4),
            JAVA_LONG.withName("meta_size"),
            JAVA_LONG.withName("tot_space")
        ).withName("free"),
        MemoryLayout.structLayout(
            JAVA_INT.withName("version"),
            MemoryLayout.paddingLayout(4),
            JAVA_LONG.withName("hdr_size"),
            MemoryLayout.structLayout(
                JAVA_LONG.withName("index_size"),
                JAVA_LONG.withName("heap_size")
            ).withName("msgs_info")
        ).withName("sohm")
    ).withName("H5F_info2_t");
    static final StructLayout const$1 = MemoryLayout.structLayout(
        JAVA_INT.withName("version"),
        MemoryLayout.paddingLayout(4),
        JAVA_LONG.withName("super_size"),
        JAVA_LONG.withName("super_ext_size")
    ).withName("");
    static final VarHandle const$2 = constants$172.const$1.varHandle(MemoryLayout.PathElement.groupElement("version"));
    static final VarHandle const$3 = constants$172.const$1.varHandle(MemoryLayout.PathElement.groupElement("super_size"));
    static final VarHandle const$4 = constants$172.const$1.varHandle(MemoryLayout.PathElement.groupElement("super_ext_size"));
    static final StructLayout const$5 = MemoryLayout.structLayout(
        JAVA_INT.withName("version"),
        MemoryLayout.paddingLayout(4),
        JAVA_LONG.withName("meta_size"),
        JAVA_LONG.withName("tot_space")
    ).withName("");
}


