// Generated by jextract

package com.sunya.netchdf.hdf5Clib.ffm;

import java.lang.invoke.MethodHandle;
import java.lang.invoke.VarHandle;
import java.nio.ByteOrder;
import java.lang.foreign.*;
import static java.lang.foreign.ValueLayout.*;
final class constants$248 {

    // Suppresses default constructor, ensuring non-instantiability.
    private constants$248() {}
    static final StructLayout const$0 = MemoryLayout.structLayout(
        JAVA_INT.withName("op_type"),
        MemoryLayout.paddingLayout(4),
        MemoryLayout.unionLayout(
            MemoryLayout.structLayout(
                RuntimeHelper.POINTER.withName("exists")
            ).withName("exists"),
            MemoryLayout.structLayout(
                JAVA_BOOLEAN.withName("recursive"),
                MemoryLayout.paddingLayout(3),
                JAVA_INT.withName("idx_type"),
                JAVA_INT.withName("order"),
                MemoryLayout.paddingLayout(4),
                RuntimeHelper.POINTER.withName("idx_p"),
                RuntimeHelper.POINTER.withName("op"),
                RuntimeHelper.POINTER.withName("op_data")
            ).withName("iterate")
        ).withName("args")
    ).withName("H5VL_link_specific_args_t");
    static final VarHandle const$1 = constants$248.const$0.varHandle(MemoryLayout.PathElement.groupElement("op_type"));
    static final UnionLayout const$2 = MemoryLayout.unionLayout(
        MemoryLayout.structLayout(
            RuntimeHelper.POINTER.withName("exists")
        ).withName("exists"),
        MemoryLayout.structLayout(
            JAVA_BOOLEAN.withName("recursive"),
            MemoryLayout.paddingLayout(3),
            JAVA_INT.withName("idx_type"),
            JAVA_INT.withName("order"),
            MemoryLayout.paddingLayout(4),
            RuntimeHelper.POINTER.withName("idx_p"),
            RuntimeHelper.POINTER.withName("op"),
            RuntimeHelper.POINTER.withName("op_data")
        ).withName("iterate")
    ).withName("");
    static final StructLayout const$3 = MemoryLayout.structLayout(
        RuntimeHelper.POINTER.withName("exists")
    ).withName("");
    static final VarHandle const$4 = constants$248.const$3.varHandle(MemoryLayout.PathElement.groupElement("exists"));
    static final StructLayout const$5 = MemoryLayout.structLayout(
        JAVA_INT.withName("op_type"),
        MemoryLayout.paddingLayout(4),
        MemoryLayout.unionLayout(
            MemoryLayout.structLayout(
                RuntimeHelper.POINTER.withName("file")
            ).withName("get_file"),
            MemoryLayout.structLayout(
                JAVA_LONG.withName("buf_size"),
                RuntimeHelper.POINTER.withName("buf"),
                RuntimeHelper.POINTER.withName("name_len")
            ).withName("get_name"),
            MemoryLayout.structLayout(
                RuntimeHelper.POINTER.withName("obj_type")
            ).withName("get_type"),
            MemoryLayout.structLayout(
                JAVA_INT.withName("fields"),
                MemoryLayout.paddingLayout(4),
                RuntimeHelper.POINTER.withName("oinfo")
            ).withName("get_info")
        ).withName("args")
    ).withName("H5VL_object_get_args_t");
}


